import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีชมพู)
st.markdown("# :pink[🏋️แอปพลิเคชันคำนวนค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 ช่องรับค่าน้ำหนักและส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):")
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):")

#ส่วนที่ 3 สร้างปุ่มกดคำนวน
if st.button("คำนวนค่า BMI 🎯"):
    # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวน BMI
    height_m = height_cm / 100
    bmi = weight / (height_m ** 2)

    st.write("---")
    st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 แปลผลค่า BMI ตามเกณฑ์
  if bmi < 18.5: 
      st.warning(" ⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
  elif 18.5 <= bmi < 23.0:
      st.warning(" 🎉 คุณมีน้ำหนักอยู๋ในเกณฑ์ปกติ (สุขภาพดี)")
  elif 23.5 <= bmi < 25.0:
      st.info(" 💡 คุณมีน้ำหนักเกินเกณฑ์ (ท้วม)")
  else:
      st.error(" 🚨 คุณอยู๋ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและการออกกำลังกาย")

st.divider()
st.write("นางสาวชาลิสา ปันทวัง เลขที่ 4 ม.4/7")
