import streamlit as st

# 1. หัวข้อใหญ่: แนะนำตัวหลักและชื่อเจ้าของเว็บ
st.title("✨ My Digital Profile")

# 2. หัวข้อย่อยที่ 1: แนะนำตัว
st.header("🧩 สวัสดีค่ะ ดิฉันชื่อ นางสาวชาลิสา ปันทวัง ชื่อเล่น ใบตาล เลขที่ 4 อยู๋ชั้น ม.4/7 โรงเรียนยุพราชวิทยาลัย ค่ะ")
st.write("นางสาว ชาลิสา ปันทวัง")
st.write("ชื่อเล่น ใบตาล")
st.write("เลขที่ 4 ม.4/7")

# 3. หัวข้อย่อยที่ 2: เป้าหมายและอนาคต
st.header("🎯 ฉันอยากเป็นหมอฟัน")
st.write("เป้าหมาย: อยากสอบผ่านวิชาชีววิทยา")
st.write("สิ่งที่อยากเป็นในอนาคต: หมอนฟัน (Dentist) ")
